
/*
 TBApiClient.m
 */
"unknown_error"="未知异常";
"unknown_data_type"="返回数据类型错误";

/*
 TBTabBarController.m
 */
"Assets"="资产";
"Markets"="行情";
"Discover"="发现";
"Profile"="我的";
"Exchanges"="交易";

/*
 TBCustomMJRefreshFooter.m
 */
"reach_bottom"="哎呀，到底了";
"slide_load_more"="上滑加载更多";
"loading_more"="正在加载更多...";

/*
 TBCameraUtils.m
 */
"warm_tip"="温馨提示";
"camera_setting_tips"="请去-> [设置 - TokenPocket - 相机] 打开访问开关";
"confirm"="确定";
"album_access_failed"="因为系统原因, 无法访问相册";
"no_camera"="未检测到您的摄像头";

/*
 NSDate+TB.m
 */
"just_now"="刚刚";
"one_min_ago"="分钟前";
"n_min_ago"="分钟前";
"one_h_ago"="小时前";
"n_h_ago"="小时前";
"one_day_ago"="天前";
"n_day_ago"="天前";
"one_m_ago"="月前";
"n_m_ago"="月前";
"one_y_ago"="年前";
"n_y_ago"="年前";

"trans_record"="交易记录";
"transaction_succ"="交易成功";
"trans_fail"="交易失败";
"transing"="交易处理中";
"copy"="复制";
"copy_to_board"="已复制到粘贴板";
"trans_query"="交易查询";
"trans_detail"="交易详情";

"transaction"="转账";
"package_fail"="打包失败";
"packaging"="已提交，待区块确认";
"trans_suc"="转账成功";
"trans_fai"="转账失败";
"wrong_addr_tips"="请输入正确的钱包地址";
"no_enough_token"="余额不足";
"next_step"="下一步";
"wallet_addr"="钱包地址";
"input_paste_addr"="输入或粘贴钱包地址";

"trans_amount"="转账数量";
"input_out_amount"="输入转出金额";
"miner_fee"="矿工费";
"select_fee"="请选择矿工费";
"comment"="备注";
"trans_num"="交易号";
"blc_num"="区块高度";
"trans_time"="交易时间";
"copy_url"="复制URL";
"choose_token_trans"="选择代币转账";

"req_exchange_list_fail"="拉取交易列表失败";

"wrong_and_try_later"="出错了，请稍后重试";
"all"="全部";


"receive"="收款";
"receiver"="收款方";
"copied"="已复制";
"copy_wallet_addr"="复制收款地址";
"rece_amount"="收款金额";
"set_rec_amount"="请设置收款金额";

"cannot_recog_qrcode"="暂未识别出扫描的二维码";
"align_qrcode"="将二维码放入框内, 即可自动扫描";
"album"="相册";
"scan"="扫一扫";

"input_asset_name"="请输入资产名称";
"cancel"="取消";
"confirm"="确认";
"hot_coin"="热门代币";
"coming_soon"="详情即将上线，敬请期待";

"add_tokens"="添加资产";
"support_token_tip"="支持以太坊、ERC20、SWTC等区块链资产一站式管理";
"all_wallet"="全部钱包";
"no_wallet_tips"="您当前还没有钱包哦，快去创建吧~";
"ok"="好的";

"how_to"="如何设置参数？";
"advanced"="高级选项";

"custom_gas_price"="自定义 Gas Price";
"custom_gas"="自定义 Gas";

/*
 TBTransactionConfirmView.m
 */
"input_pwd"="请输入密码";
"confirm"="确认";

/*
 TBAssetHeader.m
 */
"my_asset"="我的资产";

/*
 TBAssetPopWindow.m
 */
"create_wallet"="创建钱包";

/*
 TBSearchTokenCell.m
 */
"added"="已添加";
"add"="添加";

/*
 TBAssetCreateWalletView.m
 */
"all_wallet"="全部钱包";
"has_no"="未创建";
"wallet"="钱包";
"s_wallet"="的钱包";
"s_only_token_chain"="的数字代币只能存放在该体系的钱包中";

/*
 TBDiscoveryViewController.m
 */
"dapp_recomd"="DApp Store";
"articles"="文章";
"hot_articles"="热门";
"news_flash"="快讯";
"source"="来源";
/*
 TBExchangeWalletVewController.m
 */
"switch_account"="切换账号";

/*
 TBMineViewController.m
 */
"personal_center"="个人中心";
"msg"="消息中心";
"contact"="联系人";
"help"="帮助中心";
"about"="关于我们";
"settings"="系统设置";

/*
 TBEditWalletViewController.m
 */
"saving"="保存中..";
"save_succ"="保存成功";
"save_fail"="保存失败";
"save"="保存";
"exporting"="导出中..";
"delete_caution"="请谨慎，此操作无法撤销";
"delete_succ"="删除成功";
"delete_fail"="删除失败";
"pwd_error"="密码错误";
"pwd_not_match"="密码不一致，请重试";
"export_fail"="导出失败";

/*
 TBSettingViewController.m
 */
"login_pwd"="密码登录";
"login_faceid"="面部识别";
"login_touchid"="指纹识别";
"language"="多语言";
"currency_unit"="货币单位";
"web3_setting"="web3设置";
"set"="设置";
"cancel"="取消";
"setting_nodes"="节点设置";
/*
 TBMessageCenterViewController.m
 */
"read_all"="全部已读";

/*
 TBMemonicImportWalletViewController.m
 */
"custom_path"="自定义路径";
"service_privacy"="服务及隐私条款";
"importing"="导入中..";
"m_new_wallet"="M-新钱包";
"import_succ"="导入成功";
"import_fail"="导入失败";

/*
 TBPrivateKeyImportWalletViewController.m
 */
"term_service"="服务协议";
"wallet_exist"="钱包已存在";
"pk_wallet"="PK-新钱包";
"ks_wallet"="KS-新钱包";

/*
 TBChooseTokenSystemViewController.m
 */
"choose_blc_type"="选择币种体系";
"created"="已创建";


/*
 TBImportWalletViewController.m
 */
"import_wallet"="导入钱包";
"mnemonic"="助记词";
"pri_key"="私钥";
"pub_key"="公钥";
"keystore"="Keystore";

/*
 TBCreateBackupViewController.m
 */
"backup_mnem"="备份助记词";
"backup_mnem_tips"="助记词用于恢复钱包或重置钱包密码，将它准确的抄写在纸上，并存放在只有你知道的安全的地方。";
"backup_pk"="备份私钥";
"backup_pk_tips"="私钥用于恢复钱包或重置钱包密码，将它准确的抄写在纸上，并存放在只有你知道的安全的地方。";

/*
 TBConfirmMemonicViewController.m
 */
"confirm_result"="验证结果";
"reconfirm_mnemonic"="助记词顺序验证错误，请重新确认";
"reconfirm_pk"="私钥验证错误，请重新确认";
"backup_succ"="备份成功";

/*
 TBCreateWalletViewController.m
 */
"choose_wallet_chain_type"="请选择钱包体系";
"complete_info"="请填写完整的信息";
"read_and_agree"="请阅读并同意服务及隐私条款";
"tips"="提示";
"create_succ"="创建钱包成功";
"create_fail"="创建钱包失败";

/*
 TBBackupWalletViewController.m
 */
"backup_wallet"="备份钱包";

/*
 TBSelectChainTypeViewController.m
 */
"choose_blc_type"="选择钱包体系";
"chain_info_retry"="体系信息获取失败，请重试";
"already_wallet"="无法导入,您已创建";

/*
 TBWalletManagerViewController.m
 */
"wallet_manage"="钱包管理";
"total_asset"="资产总览";

/*
 TBAboutUsViewController.m
 */
"pri_policy"="隐私策略";
"ver_release"="版本日志";
"check_update"="检测新版";
"app_guide"="产品向导";

/*
 TBEditPasswordViewController.m
 */
"modify_succ"="修改成功";
"modify_fail"="修改失败";
"change_pwd"="更改密码";
"done"="完成";

/*
 TBMessageCenterCell.m
 */
"receiver"="接收方";
"trans_succ"="转账成功";
"trans_noti"="转账通知";
"sender"="发送方";

/*
 TBChooseTokenSystemCell.m
 */
"blc_type"="体系";

/*
 TBPasswordView.m
 */
"weak"="弱";
"normal"="一般";
"good"="很好";
"safe"="安全";

/*
 TBAboutUsCell.m
 */
"curr_version"="当前版本：";

/*
 TBWalletChainCell.m
 */
"created"="已创建";

/*
 TBTransactionRecoderCell.m
 */
"processing"="打包中";

/*
 TBMarketEditViewController.m
 */
"all_select"="全选";
"unselect"="全不选";
"delete_fail_retry"="删除失败，请重试";
"delete"="删除";

/*
 TBMarketViewController.m
 */
"no_token_go_add"="您还没有代币，赶紧去添加吧~";

/*
 TBMarketSearchViewController.m
 */
"search_token_market"="搜索代币行情";
"add_fail"="添加失败";
"hot_rec"="热门推荐";

/*
 TBJTManager.m
 */
"missing_param"="缺少参数";
"sign_failed"="本地签名失败";

/*
 TBAuthPasswordViewController.m
 */
"pls_repeat_pwd"="请再次输入密码";
"input_pwd_auth"="请输入密码，以验证身份";
"contact_us"="出问题了，赶紧和我们联系吧";
"wrong_pwd"="密码不正确，请重新输入";
"no_deviceId"="对不起，当前设备不支持指纹/面部ID";
"deviceId_wrong"="指纹/面部ID不正确，验证失败";
"auth_failed"="验证失败";
"auth_fail_to_pwd"="多次错误，指纹/面部ID已被锁定，请到手机解锁界面输入密码";
"setting_succ"="设置成功";

/*
 TBForceCreateWalletViewController.m
 */
"usr_agreement"="用户协议";

/*
 TBEnterAuthViewController.m
 */
"auth_pwd"="密码验证";
"touch_pwd"="点击进行密码验证";
"touch_touchId"="点击唤醒指纹验证";
"touch_faceId"="点击唤醒面部验证";

/*
 AppDelegate.m
 */
"update_tips"="Token Pocket已更新，有更棒的体验和功能，快快下载吧~";
"go_download"="前往下载";

/*
 JHPieChart.m
 */
"amount"="数量";
"rate"="占比";

/*
 TBAuthID.m
 */
"input_pwd1"="输入密码";
"auth_with_touchId"="通过Home键验证已有指纹";
/*
 TBTransactionEmptyView
 */
"soon"="敬请期待";
"de_exchange"="去中心化的全球数字资产交易所";

/*
 TBMarketHeader.h
 */
"now_price"="最新价";
"change_ratio"="涨跌幅";
"no_market_tendency"="当前暂无行情";
"add_tendency"="添加行情";

"pay_wallet"="付款钱包";
"trans_out"="转入地址";
"trans_info"="订单信息";
"trans_detail"="交易详情";
"confirm_trans"="确认支付";

"fee_setting"="矿工费设置";
"gas_slow"="慢";
"gas_fast"="快";
"gas_rec"="推荐";

"wallet_delete"="删除钱包";
"wallet_name"="钱包名称";
"wallet_addr"="钱包地址";
"change_pwd"="修改密码";
"export_pk"="导出私钥";
"export_keystore"="导出Keystore";
"addr_copy"="复制";

"pwd_curr"="当前密码";
"pwd_new"="新密码";
"pwd_repeat"="确认密码";
"pwd_forget"="忘记密码？导入私钥可重置密码。";
"import_imid"="马上导入";

"pla_pwd_curr"="当前密码";
"pla_pwd_new"="新密码";
"pla_pwd_repeat"="确认密码";

"total_asset_title"="总资产";
"title_share_to"="分享到";
"title_button_cancel"="取消";
"wx_frnds"="微信好友";
"wx_timeline"="朋友圈";
"share_qq"="QQ";

"backup_wallet_line"="为了您钱包的安全";
"backup_tips"="请备份私钥或助记词";

"tip_one"="密码用于保护私钥和交易授权，强度非常重要";
"tip_two"="TokenPocket不存储密码，也无法帮您找回，请务必牢记";

"wallet_foundation"="钱包体系";
"set_pwd"="设置密码";
"repeat_pwd"="确认密码";
"pwd_hint"="提示信息";
"pwd_optional"="可不填";
"read_agree"=" 我已仔细阅读并同意";
"input_private_key"="请输入明文私钥";
"input_public_key"="请输入公钥或者账号名";
"input_mnemonic_words"="请输入助记词，按空格做分隔";
"derive_path"="取回路径";
"import_start"="开始导入";
"ks_pwd"="Keystore 密码";
"input_ks_key"="请输入Keystore";
"what_is_ks"="什么是Keystore?";
"import_ks_desc"="直接复制粘贴钱包 Keystore 文件内容至输入框。或者通过生产 Keystore 内容的二维码，扫描录入。";
"import_ks_tips"="请检查Keystore输入是否正确，建议直接复制黏贴";

"pwd_length_tip"="不少于8位字符，建议混合大小写字母、数字、特殊符号";
"pwd_length_weak"="密码强度太低，极易被黑客破解";

"mnemonic_write_down"="抄写下你的钱包助记词";
"pk_write_down"="抄写下你的钱包私钥";
"confirm_mnemonic_title"="确认你的钱包助记词";
"confirm_pk_title"="确认你的钱包私钥";
"confirm_mnemonic_desc"="请按顺序点击助记词，验证您备份的助记词是否正确。";
"confirm_pk_desc"="请输入钱包私钥，验证备份的私钥是否正确。";
"entry_agree"="进入即代表同意服务协议和隐私条款";
"tap_reauth"="点击再次认证";

"send_trans_fail"="发生交易失敗";
"desc_wrong_pwd"="密码不正确";

"backup_wallet_line_prefix"="为了您钱包";
"backup_wallet_line_suffix"="的安全";
"backup_tips"="请备份私钥或助记词";
"backup_now"="立即备份";

"read_first"="请阅读并同意服务条款";
"illegal_mnem"="非法助记词，请检查";
"about_us_desc"="Token Pocket是一款移动端轻钱包APP，它旨在为普通用户提供一款安全放心、简单好用、功能强大的数字资产钱包。";

"phone_num"="电话号码";
"e_mail"="邮箱";
"contact_comment"="备注";
"title_contact"="联系人";

/*
 * TBExportKeystoreViewController
 */
"export_ks"="导出 Keystore";
"qrcode"="二维码";
"ks_file"="Keystore文件";
"copy_ks"="复制 Keystore";
"off_line_save"="离线保存";
"off_line_save_tips"="请复制粘贴 Keystore 文件到安全、离线的地方保存。切勿保存至邮箱、记事本、网盘、聊天工具等，非常危险";
"no_net_transmission"="请勿使用网络传输";
"no_net_transmission_tips"="请勿通过网络工具传输 Keystore 文件，一旦被黑客获取将造成不可挽回的资产损失。建议离线设备通过扫二维码方式传输";
"password_safe_deposit"="密码保险箱保存";
"password_safe_deposit_tips"="如需在线保存，则建议使用安全等级更高的 1Password 等密码保管软件保存 Keystore";
"only_scan"="仅供直接扫描";
"only_scan_tips"="二维码禁止保存、截图、以及拍照。仅供用户在安全环境下";
"use_safely"="在安全环境下使用";
"use_safely_tips"="请在确保四周无人及无摄像头的情况下使用。二维码一旦被他人获取将造成不可挽回的资产损失";
"confirmed_no_p_c"="已确认周围无人及摄像头";
"show_code"="显示二维码";
"no_screenshots"="请勿截图";
"make_sure_safely"="请确保四周无人且无任何摄像头！勿用截图或拍照的方式保存 Keystore 文件或对应二维码";
"i_know"="我知道了";

/*
 * TBAssetSearchTokenViewController
 */
"search_token_placeholder"="输入token或合约地址";

/*
 * EOS
 */
"eos_blc_eth"="以太坊";
"eos_blc_eth_desc"="以太坊体系";
"eos_wallet_vc_title"="已为您生成了EOS主链钱包，请做好备份工作";
"eos_important_tips"="重要提示：";
"eos_backup_desc"="请确保在纸上将私钥抄下，并妥善保管好。请勿将私钥存储在网盘工具，非常危险！";
"eos_title_wallet"="EOS钱包";
"eos_start_backup"="开始备份";
"eos_use_exist_wallet"="使用已有的EOS钱包";
"eos_wallet_creating"="创建中...";
"eos_title_eth_wallet"="以太坊钱包";
"eos_title_pubkey"="EOS公钥";
"eos_title_to_add"="转入地址";
"eos_title_amount"="金额";
"eos_title_miner_fee"="矿工费";
"eos_btn_mapping"="开始映射";
"eos_placeholder_select_wallet"="选择要进行映射的钱包";
"eos_title_contract_add"="地址详情";
"eos_title_mapping_info"="映射信息";
"eos_map_success"="映射成功";
"eos_tips_select_wallet"="请选择进行映射的钱包";
"eos_tips_input_eos"="缺失EOS公钥";
"eos_mapped"="该地址已映射，请重选";
"eos_mainnet_tip"="映射成功后，当主网启动时，原生币将转入您的EOS地址！";
"eos_title_eth_add"="ETH地址:";
"eos_title_eos_add"="EOS地址:";
"eos_map_verify_suc"="映射验证成功";
"eos_map_verify_fail"="映射验证失败";
"eos_map_verify_wait"="映射处理中...";
"eos_map_verify_token_prefix"="你拥有";
"eos_map_verify_token_suffix"="个EOS原生币";
"eos_map_verify_token_empty"="你当前没有EOS原生币";
"eos_map_verify_loading"="加载中";
"eos_wallet_own_placeholder"="点击输入EOS公钥";
"eos_wallet_next"="下一步";
"eos_wallet_use_own_prefix"="重要提示：";
"eos_wallet_use_own_suffix"="您正在使用自己的EOS钱包，请确保您输入钱包公钥的正确性，TokenPocket无法提供检验钱包的正确性";
"eos_plz_input"="请输入正确的EOS公钥";
"eos_eth_title"="ETH验证：";
"eos_eth_address"="请选择验证的钱包";
"eos_eth_choose"="选择";
"eos_eth_start_verify"="开始验证";
"eos_eth_tips_pre"="重要提示：";
"eos_eth_tips_suffix"="如果刚完成映射操作，在区块打包完成前，并不会查询到信息，如遇此情况，请稍等片刻再进行验证";
"eos_eth_address_empty"="钱包地址不可为空";
"eos_title_verify"="EOS验证";
"eos_title_result"="验证结果";
"eos_title_own_wallet"="EOS公钥";
"blc_basic_jt"="井通";
"blc_basic_jt_desc"="井通体系";
"blc_basic_moac"="墨客";
"blc_basic_moac_desc"="墨客体系";

/*
 * TBChooseWalletSheet
 */
"choose_wallet"="选择钱包";
"create_or_import_wallet"="创建或导入钱包";

//Nodes Setting
"eth_node_empty"="以太坊节点地址不可为空";
"mc_node_empty"="墨客节点地址不可为空";
"jt_node_empty"="井通节点地址不可为空";
"eos_node_empty"="EOS节点地址不可为空";
"node_reset_default"="重置为默认节点";

//2018-05-23
"account_chars_tip"="账号名由小写字母和1-5组成的长度为12的字符串";
"account_name"="账号名称";
"account_name_length"="账号名长度必须为12";
"account_name_chars"="账号名称中包含非法字符，只能由小写字母和1-5的数字组成";
"account_name_existed"="账号名称已被使用";
"eos_invalid_private_key"="无效的私钥地址，请确认是否抄写正确";
"eos_transfer_account_placeholder"="转入账号";
"eos_transfer_account_from"="转出账号";
"eos_transfer_account_to"="转入账号";
"eos_transfer_error_no_balance"="没有余额";
"eos_transfer_error_to_self"="不要给自己转账哦亲~";
"eos_transfer_error_not_exist"="账号不存在";
"eos_transfer_error_invalid_quantity"="无效的数量";
"eos_transfer_error_over_balance"="余额不足";
"eos_transfer_error_memo_more"="备注太长啦~";
"eos_transfer_error_mismatch"="小数太多了！";
"eos_copy_account_name"="复制收款账号";
"eos_vote"="投票";
"eos_vc_vote"="投票";
"eos_vc_voted"="已投";
"eos_vc_bp_list"="投票";
"eos_vc_rank"="排名";
"eos_vc_detail"="超级代理";
"eos_vote_units"="票";
"eos_manage_delegate"="抵押";
"eos_manage_refund"="赎回";
"eos_title_vote"="EOS 投票";
"eos_votes_manage"="资源管理";
"eos_title_votes_manage"="资源管理";
"eos_vote_balance"="余额";
"eos_vote_delegate"="抵押";
"eos_vote_refund"="赎回中";
"eos_vote_manage_desc"="· 进行投票需要抵押相应数量的EOS\n· 抵押的EOS可撤销抵押，并于3天后退回原账号";
"eos_vote_action_delegate"="资产抵押";
"eos_vote_action_refund"="取消抵押";
"eos_vote_placeholder_delegate"="请输入抵押金额";
"eos_vote_placeholder_undelegate"="请输入取消抵押金额";
"eos_vote_progress"="进度";
"eos_vote_canvote"="已抵押";
"eos_vote_area"="区域";
"eos_request_error"="出错了";
"eos_incorrect_wallet"="钱包错误";
"eos_vote_suc"="投票成功";
"eos_vote_failed"="请再次尝试";
"eos_voter_over"="最多可投30人";
"eos_vc_cancel_vote"="撤销投票";
"eos_vc_delegated_succ"="抵押成功";
"eos_vc_undelegated_succ"="取消抵押成功";
"eos_vc_balance_insufficent"="余额不足";
"eos_vc_staked_insufficent"="抵押不足，可前往高级管理处理";
"eos_proxy_name"="名称";
"eos_proxy_account"="账号";
"eos_proxy_slogon"="介绍";
"eos_proxy_name_pla"="输入您的代理名";
"eos_proxy_account_pla"="输入竞选代理的账号";
"eos_proxy_slogo_pla"="简单描述自己";
"eos_proxy_submit"="提交";
"eos_proxy_contact"="更多内容联系我们";
"eos_proxy_state"="|  申请说明";
"eos_proxy_state_detail"="请您按照以下信息准确填写，提交后我们将按照用户协议进行尽快审核，审核通过即可参与竞选。";
"eos_proxy_apply"="申请成为代理";
"eos_proxy_optional"="选填";
"eos_proxy_title"="代理申请";
"eos_proxy_input_name"="请输入名称";
"eos_proxy_input_account"="请输入账号";
"eos_proxy_input_slogan"="请输入简单介绍";
"eos_proxy_submit_success"="已提交";
"eos_proxy_weight"="投票权重";
"eos_proxy_account"="账号";
"eos_proxy_location"="区域";
"eos_proxy_website"="网站";
"eos_proxy_intro"="介绍";
"eos_proxy_vote_now"="立即投票";
"eos_proxy_vote_weight"="代理权重";
"eos_not_proxy"="账号不是代理";
"eos_proxy_unvote"="撤票";
"eos_proxy_share_support"="快来TokenPocket支持我";
"eos_proxy_area_pla"="省份，城市";
"eos_proxy_regist_proxy"="授权注册代理";
"eos_rule_vote"="投票规则";
"eos_rule_proxy"="申请代理说明";
"eos_rule_manage"="票权说明";
"eos_proxy_cannot_vote_self"="代理不可投代理";
"blc_basic_eos"="EOS";
"blc_basic_eos_desc"="EOS体系";
"eos_progress_votes"="票";
"eos_bp_weight"="权重";
"eos_vote_no_delegate_tip"="投票前你需要抵押你的EOS(可赎回)";
"eos_delegate_forward"="前往";
"eos_delegate_cancel"="取消";
"eos_mainnet_not_enough"="主网总量抵押不足15%，还不可以取消抵押";
"eos_revote_modified_tip"="检测到当前账号已投过票，确认投票会覆盖之前投票，是否继续？";
"eos_revote_confirm"="确认";
"eos_revote_cancel"="算了";
"eos_import_new_account"="创建新账号";
//WebAction
"web_send_success"="发送成功";
"web_send_fail"="发送失败";
"web_release_success"="已受理，请等待页面刷新..";
"web_release_fail"="发行失败";

//2018-05-24
"upgrade_tips"="更新提示";

//2018-05-25
"transfer_confirming"="确认中";
//2018-05-31
"recent_transactions"="最近交易记录";
"input_wallet_name_option"="您的钱包名称";
"error_regi_proxy_exist"="您已提交过申请";
"eos_insufficient_ram"="账号RAM不足";
"eos_proxy_resign"="注销代理";
"eos_error_empty_account"="账号为空";
"eos_resign_success"="注销成功";
"eos_res_advanced"="高级管理";
"eos_res_title_CPU"="计算资源";
"eos_res_title_NET"="网络资源";
"eos_res_title_RAM"="内存资源";
"eos_res_title"="资源管理";
"eos_ram_quota"="配额";
"eos_ram_usage"="占用";
"eos_cpu_ava"="可用";
"eos_cpu_stake"="抵押";
"eos_net_ava"="可用";
"eos_net_stake"="抵押";
"eos_ram_instru"="・内存资源，可以使用EOS买入，也可以卖出获得EOS";
"eos_ram_buy_title"="购买内存";
"eos_ram_sell_title"="出售内存";
"eos_ram_buy_pla"="请输入EOS的额度";
"eos_ram_sell_pla"="请输入RAM的数量";
"eos_ram_sell_pla_new"="请输入RAM(KB)的数量";
"eos_ram_btn_buy"="购买";
"eos_ram_btn_sell"="出售";
"eos_ram_can_use_balance"="余额";
"eos_ram_insufficient_quota"="内存不足";
"eos_request_success"="成功";
"eos_sellram_float"="不可输入小数";
"eos_sellram_too_small"="出售额度必须大于65";
"eos_ram_alert_title"="输入密码";
"eos_resource_used"="占用";
"eos_resource_ava"="可用";
"eos_resource_net_title"="网络资源";
"eos_resource_cpu_title"="计算资源";
"eos_resource_manage_desc"="・获取资源需要抵押EOS\n・抵押的EOS可以撤销抵押，并于3天后退回";
"eth_go_browser_detail"="前往Etherscan查询详细信息 >";
"eos_go_browser_detail"="前往查询详细信息";
"eos_search_bp"="  请输入名称或账号名";
"eos_account_created"="您的设备已创建过账号";
"eos_account_not_support"="暂时不支持创建账号";
"eos_staked_amount_title"="已抵押";

//2018-06-12
"title_contact_us"="联系我们";
"eos_no_enough_resource"="资源不足，请前往资源管理抵押获取";
"eos_stake_no_resource"="抱歉，该账号资源不足(NET/CPU)以支持本次操作，请您设置小的额度尝试，或联系身边的朋友帮您抵押。";
"eos_net_input_account"="接收者账号";
"eos_set_account_title"="设置接收者";
"eos_res_receiver"="接收者";
"eos_res_rece_self"="自己";

//2018-06-12 16:00
"eos_recoder_type_sell_ram"="卖内存";
"eos_recoder_type_buy_ram"="买内存";
"eos_recoder_type_stake"="抵押";
"eos_recoder_type_unStake"="取消抵押";
"eos_no_ram_to_buy"="账号内存不足，请前往资源管理页面购买";
"wallet_retry"="重试";
"wallet_retry_tips"="通道拥堵，请重试";
"eos_transfer_to_address"="账号名无效，请检查";
"eos_cancel_success"="撤销投票成功";
"eos_staked_insufficient"="取消抵押额度过大";
"eos_insufficient_ram"="输入内存过大";

//2018-6-14
"contract_address"="合约";
"title_wallet"="钱包";
"tip_backup"="未备份";

//2018-6-15
"eos_create_title"="靓号小能手";
"creator"="创建者";
"account_pk"="账号公钥";
"account_pk_placeholder"="输入公钥或扫一扫";
"onwer_pk"="拥有者公钥";
"activity_pk"="管理者公钥";
"dispatch_ram"="分配内存";
"dispatch_cpu"="CPU抵押";
"dispatch_net"="网络抵押";
"grade_model"="高级模式";
"easy_model"="简单模式";
"register_first"="立即创建";
"register_account_success"="创建账号成功";
"register_account_fail"="创建账号失败";
"eos_title_select_account"="请选择你的账号";
"eos_import_next"="继续";
"eos_import_no_account"="该私钥没有对应账号，无法导入！";
"eos_no_active_bid"="暂时还不能竞价名字";
"eos_account_been_created"="账号已被创建";
"eos_only_suffix_create"="没有权限创建该类型后缀账号";
"eos_symbol_precision_mismatch"="精准度错误";
"eos_create_wallet_help"="账号说明";

//2018-6-17
"share"="分享";

//2018-6-17
"title_contact_type"="联系方式";
"eos_proxy_vote_ticket"="代理票数";
"eos_proxy_vote_people"="代理人数";
"eos_proxy_wechat"="微信";
"eos_proxy_qq"="QQ";
"eos_proxy_wechat_pla"="请输入您的微信号码";
"eos_proxy_qq_pla"="请输入您的QQ号码";

//2018-6-18 10:11
"eos_right_owner"="拥有者权限";
"eos_right_active"="管理者权限";
"eos_right_threshold"="权重阈值";
"eos_right_link_pub"="关联公钥";
"eos_right_weight"="权重";
"eos_faq_owner_title"="什么是拥有者权限（Owner）？";
"eos_faq_owner_expl"="Owner 代表了对账号的所有权，可以对权限进行设置，管理Active和其他角色。";
"eos_faq_active_title"="什么是管理者权限（Active）？";
"eos_faq_active_expl"="Active用于日常使用，比如转账、投票等。";
"eos_faq_threshold"="什么是权重阈值？";
"eos_faq_threshold_expl"="权重阈值是使用该权限的最低权重要求。";
"eos_authority_management"="权限管理";
"eos_auth_submit"="提交修改";
"eos_change_owner"="修改拥有者";
"eos_change_active"="修改管理者";

//2018-6-18 10:11
"eos_right_owner"="拥有者权限";
"eos_right_active"="管理者权限";
"eos_right_threshold"="权重阈值";
"eos_right_link_pub"="关联公钥";
"eos_right_weight"="权重";
"eos_faq_owner_title"="什么是拥有者权限（Owner）？";
"eos_faq_owner_expl"="Owner 代表了对账号的所有权，可以对权限进行设置，管理Active和其他角色。";
"eos_faq_active_title"="什么是管理者权限（Active）？";
"eos_faq_active_expl"="Active用于日常使用，比如转账、投票等。";
"eos_faq_threshold"="什么是权重阈值？";
"eos_faq_threshold_expl"="权重阈值是使用该权限的最低权重要求。";
"eos_auth_new_pubkey"="请输入新的公钥";
"eos_auth_submit"="提交变更";
"eos_change_owner"="变更拥有者";
"eos_change_active"="变更管理者";
"eos_has_no_auth"="您没有权限操作该账号";
"eos_pub_key_empty"="新的公钥地址不可以为空";

//2018-6-19 6:50
"eos_invalid_public_key"="无效的公钥";
"eos_per_modify_title"="变更信息";
"eos_per_account"="变更账号";
"eos_per_permission"="变更权限";
"eos_per_public"="新公钥";
"eos_per_confirm_change"="确认变更";
"eos_no_any_permission"="您没有该账号的任何权限，是否删除？";
"eos_proxy_input_area"="请输入区域";

//2018-6-19 13:00
"eos_key_helper"="密钥生成器";
"eos_key_touse"="去使用";
"eos_key_back_ask"="确认已备份了私钥？";
"eos_faq_what_icon"="这些图标代表什意思";
"eos_icon_auth_change"="权限变更";
"eos_icon_self"="自己";

//2018-6-19 15:27
"eos_refund_countdown"="赎回倒计时";
"eos_refund_countdown_finish"="倒计时结束";
"eos_refund_btn_title"="立即赎回";
"eos_refund_hour"="时";
"eos_refund_day"="天";
"eos_refund_min"="分";
"refund_failed"="操作失败";
"refund_success"="赎回成功";
"eos_request_auth_not_satisfy"="密钥，权限等不匹配";
"notice_title_warning"="温馨提示";
"notice_content_permission_tips"="・在进行权限变更时，请一定要确保对方公钥的正确。\n・变更时，先从小的权限开始变更，如Active -> Owner。\n・变更前，请确保资产已做好妥善处理！";

//2018-6-20
"about_unstake"="关于赎回";
"about_unstake_tips"="为了您抵押的EOS能尽量回到当前账号，建议您至少保留0.2个EOS于抵押中，作为撤销抵押的资源消耗。";
"eos_current_wrong_wallet"="您当前钱包不是EOS钱包，选择EOS钱包后方可使用服务。";
"eos_current_wrong_wallet_title"="温馨提示";
"title_create_wallet"="创建钱包";
"more"="更多";
"pwd_forget_title"="忘记密码？";

//2018-6-25
"eos_buy_to_self"="自己";
"eos_buy_to_other"="他人";
"eos_tap_to_refund"="点击赎回";
"stake_style_title"="抵押方式";
"stake_style_trans"="过户";
"stake_style_no_trans"="租借";
"eos_ram_price"="当前内存价格";
"eos_cpu_price"="计算资源价格";
"eos_net_price"="网络资源价格";
"eos_main_ram"="全网内存";
"eos_ram_chart_title"="内存趋势";
"eos_res_title_ram"="内存";
"eos_res_title_net"="网络";
"eos_res_title_cpu"="计算";
"eos_main_res_title"="资源";


//2018-6-28
"eos_stake_no_cpu"="抱歉，该账号计算资源不足以支持本次操作，请您设置小的额度尝试，或联系身边的朋友帮您抵押。";
"eos_stake_no_net"="抱歉，该账号网络资源不足以支持本次操作，请您设置小的额度尝试，或联系身边的朋友帮您抵押。";
"eos_account_create"="免费创建EOS账号活动已结束，您可以选择尝试我们提供的付费创建功能";
"error_bidname_lower"="您的竞拍价格可能低于当前最新竞拍价";

//2018-6-29
"contact_create"="新建联系人";
"contact_edit"="编辑联系人";
"add_wallet_address"="添加钱包地址";
"add_wallet_type"="钱包底层";
"add_wallet_address_account"="地址";
"add_wallet_address_account_tips"="扫描或者粘贴钱包地址";
"contact_delete_tips"="确认删除吗?";
"choose_address"="请选择地址";

//2018-06-30
"import_pwd_empty"="密码为空";

//2018-07-01
"rammark_pie_title"="成交资金分布";
"rammark_pie_big"="大单";
"rammark_pie_med"="中单";
"rammark_pie_small"="小单";
"rammark_pie_in"="流入";
"rammark_pie_out"="流出";
"rammark_pie_deals"="成交分布";
"rammark_top_open"="今开";
"rammark_top_total"="总资金";
"rammark_top_ramratio"="内存占比";
"rammark_buy_record"="买卖记录";
"rammark_bigbuy_record"="大单记录";
"rammark_huge_holds"="持量大户";
"rammark_title_buy"="买";
"rammark_title_sell"="卖";
"rammark_action_buy"="买入";
"rammark_action_sell"="卖出";
"rammark_input_placeholder"="输入数量";
"rammark_title"="内存交易";
"rammark_state"="交易中";

//2018-07-02
"eos_byte_keep_tips"="建议预留1024byte用于本次操作的内存消耗";
"eos_ram_exchange_ent"="   内存交易   ";
"eos_create_account_tips"="不完整信息，无法创建账号";
"eos_create_account_cost"="大概花费";

//2018-07-05
"order_tips"="创建EOS账号需要消耗EOS，请您找拥有EOS余额的可信账号帮你支付本次创建费用。";
"order_title"="订单信息";
"order_delete"="删除订单";
"order_create_for_other"="请朋友帮忙";
"order_account_active"="激活账号";
"order_account_active_success"="激活成功";
"order_account_warn_owner_active"="该账号有多个私钥拥有onwer权限和active权限，风险极大。";
"order_account_warn_owner"="该账号有多个私钥拥有onwer权限，风险极大。";
"order_account_warn_active"="该账号有多个私钥拥有active权限，风险极大。";
"order_account_warn_only_owner"="您只拥有该账号的onwer权限，风险极大。";
"order_account_warn_only_active"="您只拥有该账号的active权限，风险极大。";
"order_account_register_other"="账号被他人抢注，可能存在安全问题，请谨慎";
"order_account_not_create"="账号还未注册";
"order_account_not_create"="账号还未注册";
"order_delete_tips"="确认删除订单吗？";
"order_continue_tips"="当前有未完成的EOS订单，是否前往激活";
"eos_localaccount_exception"="请检查您是否拥有足够计算、网络、内存及余进行本次操作";
"order_pre_tips_confirm"="如果您确认该账号下所有权限是您自己的密钥无误，可自行用私钥导入钱包。";
"res_requried_tips"="买卖操作会消耗资源，请及时留意您的内存计算网络资源是否充足，我们建议网络和计算资源分别至少抵押0.5个EOS，如果您的资源不足，会导致您的交易被区块回滚。";
"success_wait_block_require"="提交成功，待区块确认";
"unstake_cpu_all"="无法全部取消抵押，为保证操作成功，请至少预留0.4 EOS的计算";
"unstake_net_all"="无法全部取消抵押，为保证操作成功，请至少预留0.4 EOS的网络";
"sell_ram_all"="为保证交易成功，请您至少保留100Bytes";
"order_teach"="点击查看教程";
"order_teach_title"="教程";

//2018-07-09
"eos_no_account"="没有账号";
"eos_pk_check"="校验私钥";
"eos_pubk_check"="根据公钥检测账号";
"app_version_last"="已经是最新版本";
"app_share_friends"="邀请好友";

//2018-07-11
"eos_ran_remind"="价格预警";
"eos_ran_remind_introduce"="TokenPocket预警分为两种形式:";
"eos_ran_remind_price"="价格预警";
"eos_ran_remind_price_tips_1"="价格预警分为上限价格和下限价格。";
"eos_ran_remind_price_tips_2"="当价格到达某个位置时，系统会发出警报，同一个价格每日最多警报4次，每日推送短信12条为上限。";
"eos_ran_remind_price_tips_3"="最多可以同时设置3条价格预警。";
"eos_ran_remind_big"="大户跟踪预警";
"eos_ran_remind_big_tips_1"="大户跟踪行为分为买入跟踪和卖出跟踪。";
"eos_ran_remind_big_tips_2"="当买入和卖出达到设定值或超过设定值时，会进行短信推送，每个设定值每日最多警报4次，每日推送短信条数为12条。";
"eos_ran_remind_big_tips_3"="最多可以同时设置3条大户预警。";
"eos_ran_remind_tips_1"="注：由于不同地区网络环境存在一定偏差，本服务仅限于跟踪，不适用于实施挂单。本服务属于 TokenPocket 增值服务，最终解释权归 TokenPocket 所有，一旦订阅无法退款。";
"eos_ran_remind__price_desc_pre"="本服务价格为";
"eos_ran_remind__price_desc_suf"="EOS/月。";
"eos_ram_open"="立即开通";
"eos_ram_remind_price_up"="上限价格";
"eos_ram_remind_price_down"="下限价格";
"eos_ram_remind_big_amount"="预警数量";
"eos_ram_remind_big_direction"="方向";
"eos_ram_remind_add"="添加预警";
"eos_ram_remind_big_set_title"="设置预警大户";
"eos_ram_remind_big_set_account"="大户账号";
"eos_ram_remind_big_set_direction"="流动方向";
"eos_ram_remind_big_set_amount_placeholder"="请输入数量";
"eos_ram_remind_price_set_title"="设置预警价格";
"eos_ram_remind_price_set_placeholder"="请输入价格";
"eos_ram_remind_open_confirm_title"="价格预警服务";
"eos_ram_remind_open_confirm_phone"="手机";
"eos_ram_remind_open_confirm_fee"="费用";
"eos_ram_remind_open_title"="短信预警";
"eos_ram_remind_open_phone"="手机号码";
"eos_ram_remind_open_phone_placeholder"="请输入手机号码";
"eos_ram_remind_open_tips"="预警仅做价格警报，由于网络环境存在一定偏差，不适用于实时挂单。";
"eos_ram_remind_current_price"="当前价格";
"eos_ram_remind_current_rise"="当前涨跌幅";
"eos_ram_remind_open_ret_success"="开通成功";
"eos_ram_remind_open_ret_pay_fial"="付款失败";
"eos_create_type_transfer"="交易所转账/钱包转账方式";
"eos_create_type_scan"="请好友使用TokenPocket扫码";
"eos_create_type_select"="选择创建方式";
"eos_ram_remind_out_service_time"="服务到期时间：";

//2018-7-11
"eos_contract_create_process"="操作流程";
"eos_contract_create_desc1"="通过交易所提币并备注或钱包转账并备注的方式向以下地址转入至少2个EOS完成账号创建。其中0.2 EOS 用来抵押计算和网络资源，剩余部分会帮用户购买等值内存。";
"eos_contract_create_desc2"="目前明确支持该方式的交易所有OTCBTC、Gate.io、币安、Bitfinex。请不要使用其他交易所提币！钱包方面只要支持转账备注都可以。";
"eos_contract_create_transaccount"="转入账号（必填）";
"eos_contract_create_copy"="复制";
"eos_contract_create_memo"="转入备注（必填）";
"eos_contract_create_delete"="删除订单";
"eos_contract_create_active"="激活账号";
"eos_contract_create_tip"="注明：\n该创建方式是使用 Dappub 团队部署的智能合约进行创建，在创建过程中不涉及人工操作。如由于用户操作不当导致资产损失，TP无法帮助用户找回。";
"eos_contract_create_opensource"="合约开源地址：";
"eos_contract_create_navTitle"="合约注册";
"eos_permission_developing"="开发中";

//2018-7-14
"bl_node_eth_setting"="ETH节点设置";
"bl_node_moac_setting"="MOAC节点设置";
"bl_node_jt_setting"="JingTum节点设置";
"bl_node_eos_setting"="EOS节点设置";
"bl_node_add_node"="添加自定义节点";
"bl_node_type_default"="默认节点";
"bl_node_type_custom"="自定义节点";
"bl_node_invalid"="请输入有效的节点地址";

//2018-7-16
"order_account_create_state_create"="账号创建中..";
"order_account_create_state_required"="账号状态确认中..";
"order_account_create_state_required_fail"="账号状态确认失败";
"order_account_create_state_safe"="账号安全检测中..";

//2018-7-17
"eos_dapp_action_type"="类型";
"eos_dapp_action_detail"="详细数据";
"eos_dapp_action_type_transaction"="转账";
"eos_dapp_action_type_vote"="投票";
"eos_dapp_action_type_stake"="抵押";
"eos_dapp_action_type_unstake"="取消抵押";
"eos_dapp_action_type_buyram"="买内存";
"eos_dapp_action_type_sellram"="卖内存";
"eos_dapp_action_type_updateauth"="变更权限";
"eos_dapp_action_type_bidname"="账号竞拍";
"eos_dapp_action_type_newaccount"="创建账号";

//2018-7-18
"setting_color_switch"="红涨绿跌";
"title_ram_my_record"=" 我的记录";
"invite_code_title"="你的专属邀请码";
"invite_btn_title"="   立即邀请   ";
"invited_prefix"="你已经邀请了";
"invited_fnds"="位朋友";
"invited_win"="获得";
"invited_bonus"="积分";
"invite_rule"="活动规则:";
"invite_rules_desc"="1、活动期间，绑定手机号即可获得100积分；邀请用户下载，推荐人和被邀请人均可获得100积分；多邀请多得，上不封顶。\n2、每位用户只能被邀请一次，输入邀请码确认邀请关系；\n3、积分可在后期按一定规则进行糖果兑换。\n4、手机号与邀请码一一对应\n5、更多积分兑换方式请持续关注TokenPocket官方公众号。\n6、活动最终解释权归TokenPocket所有。";
"title_gain_bonus"="领取奖励";
"invite_get_code"="   获取邀请码   ";
"invite_bind_phone_get"="绑定手机，立即获取积分";
"invite_write_inviter"="填写邀请码";
"invite_inviter_desc_title"="请输入邀请码，赢积分";
"invite_inviter_code_pl"="请输入邀请码";
"invite_inviter_detail"="邀请码填写正确后不可修改，确认后邀请人和被邀请人均可获得积分";
"invite_inviter_confirm"="确定";
"invite_bind_phone_title"="填写手机号";
"invite_bind_phone_desc"="绑定手机号，获取邀请码";
"invite_bind_phone_pl"="请输入手机号码";
"invite_bind_phone_detail"="手机号与邀请码一一对应，领取奖励前必须先绑定手机";
"invite_code_empty"="邀请码不能为空";
"invite_code_error"="邀请码不正确，请输入正确邀请码";
"invite_code_mine"="我的专属邀请码";
"invite_code_where_input"="邀请码可在邀请页面输入";
"invite_code_scan_download"="扫码下载";
"invite_phone_empty"="手机号码不可为空";
"eos_transfer_memo_tips"="当前转账账号是交易所账号，请确保Memo是否正确";
"eos_transfer_ensure_continue"="继续";
"eos_transfer_ensure_check"="检查";
"invite_gain_bonus_suc"="成功领取奖励";
"invite_gain_bonus_repeat"="奖励已领取，请勿重复领取";
"invite_bind_to_gain"="领取奖励前必须先绑定手机";
"dapp_mode_open"="开启开发者模式";
"dapp_mode_close"="关闭开发者模式";

//2018-7-25
"dapp_platform"="平台";
"dapp_search"="搜索";

//2018-7-26
"eos_change"="变更";
"eos_add"="增加";
"eos_add_permission"="增加权限";
"eos_add_permission_account"="新账号";
"eos_auth_new_pubkey_account"="请输入新的公钥或账号";
"eos_ram_panel"="交易面板";
"eos_developer_mode_desc"="开发者模式是提供给开发者用来开发和调试基于钱包的DApp，开发者模式开启后，可在发现页面添加自定义URL进行调试。\n该模式仅限于开发者调试测试使用，请不要添加任何不信任的地址，由于自定义URL或第三方Dapp导致的财产损失，由用户自行承担。";
"eos_developer_mode_check"="我已明确开发者模式的用途以及责任。";
"title_developer_mode"="开发者模式";
"title_developer_edit"="点击编辑";

//2018-8-1
"enu_current_wrong_wallet"="您当前钱包不是ENU钱包，选择ENU钱包后方可使用服务。";

//2018-08-02
"vote_title_proxy"="代理投票";
"vote_title_producer"="节点投票";
"vote_btn_title_stake"="抵押管理";
"vote_btn_title_proxy"="代理管理";
"vote_desc_producer"="＊ 在进行投票前，用户需要进行EOS抵押换取投票权。\n＊ 用户可以在需要的时候取消抵押，并将于72小时候赎回抵押的EOS。";
"vote_desc_proxy"="＊ 代理投票会使社区生态更为健康\n＊ 代理者代表委托人进行集中投票。委托人可在任何时候进行代理取消。";
"vote_navi_title"="投票";
"vote_tag_partner"="合作伙伴";
"dapp_not_suppot"="当前DApp不支持";

//2018-08-03
"node_reset"="重置";

//2018-08-06
"dapp_browser"="DApp浏览器";

//2018-08-07
"eos_permission_no"="当前账号的权限已经变更，请确认账号权限是否正常";
"eos_permission_no_read"="前往查看";

//2018-08-07 17:12
"enu_contract_create_desc1"="通过交易所提币并备注或钱包转账并备注的方式向以下地址转入至少2个ENU完成账号创建。其中0.2ENU用来抵押计算和网络资源，剩余部分会帮用户购买等值内存。";
"enu_contract_create_desc2"="交易所提币或钱包转账必须支持备注。";
"enu_contract_create_tip"="注明：\n该创建方式是使用ENU社区爱好者部署的智能合约进行创建，在创建过程中不涉及人工操作。如由于用户操作不当导致资产损失，TP无法帮助用户找回。";

//2018-08-08

"apply_pro_name_placeholder"="请输入代理名称，最多12个字";
"apply_pro_input_name"="请输入代理名称";
"apply_pro_max_name"="代理名称过长，最多64个字符";

"apply_pro_slogan_placeholder"="请输入您的参选口号";
"apply_pro_input_slogan"="请输入代理口号";
"apply_pro_max_slogan"="代理口号过长，最长64个字符";


"apply_pro_input_phi"="请输入您的代理理念";
"apply_pro_max_phi"="您的代理理念过长，最长1024个字符";
"apply_pro_phi_plac"="请您填写您的参选理念";

"apply_pro_input_bg"="请输入您的个人背景";
"apply_pro_max_bg"="您的个人背景过长，最长1024个字符";
"apply_pro_bg_plac"="请您填写您个人背景，有助于投票者对您的了解。";
"proxy_voter_title"="投票者";
"apply_no_avatar"="请设置您的代理头像";
"apply_pro_tg"="输入电报号";
"apply_pro_tw"="输入steemit地址";
"apply_pro_wechat"="输入微信号";
"apply_pro_web"="输入网站地址";

"apply_pro_price"="申请代理过程中，需要消耗至少1kb的ram，是否继续";

"apply_pro_avatar_uploading"="正在上传头像";
"apply_pro_avatar_failed"="传输头像失败";
"apply_pro_reg_info"="正在注册代理信息";
"apply_pro_reg_suc"="代理信息提交成功，将在几分钟内生效";
"apply_pro_reg_fail"="代理信息提交失败";
"apply_pro_reging"="正在注册代理";
"apply_no_access_album"="没有相册使用权限";
"apply_tap_logo"="点击编辑logo";
"apply_pro_delete"="删除代理需要您授权";
"apply_pro_deleting"="正在删除代理信息";
"apply_pro_delete_fail"="删除代理信息失败";
"apply_pro_delete_system"="正在撤销代理";
"apply_pro_delete_system_fail"="撤销代理失败";
"apply_pro_delete_system_succ"="撤销代理成功";

"apply_pro_title_name"="名称";
"apply_pro_title_slo"="口号";
"apply_pro_title_phi"="理念";
"apply_pro_title_bg"="自我介绍";
"apply_pro_title_web"="网站";
"apply_pro_title_tele"="电报";
"apply_pro_title_steemit"="Steemit";
"apply_pro_title_wechat"="微信";

//2018-08-08 17:20
"contact_memo_tips"="打开右侧开关，转账操作将默认填写该备注";
"proxy_stake_title"="代理票数";
"proxy_pro_title"="已投节点";
"proxy_btn_vote"="立即投他";
"proxy_btn_quit"="已退选";
"proxy_btn_edit_info"="编辑信息";
"proxy_contact_title"="联系方式";
"apply_btn_detail"="    详情 »";
"proxy_voters_title"="人";
"proxy_delete_before"="注册代理前需要您先撤销已投的代理";
"proxy_tilte_close"="关闭";
"slogan_words"="你的通用数字钱包";
"slogan_from"="分享来自TokenPocket";
"title_proxy_option"=" （选填）";

"reclaim_stake"="赎回抵押";
"stake_list"="租借列表";

//2018-8-14
"dapp_suppot"="当前DApp只支持 ";

//2018-8-15
"web_url_refresh"="刷新";
"web_url_open_browser"="浏览器打开";
"web_url_power_prefix"="此服务由 ";
"web_url_power_suffix"=" 提供";

//2018-8-16
"res_title_receiver"="接收账号";
"res_stake_total"="总量";
"res_input_amount_pla"="输入EOS数量";
"res_cpu_stake_title"="计算抵押";
"res_net_stake_title"="网络抵押";
"res_cpu_reclaim_title"="计算赎回";
"res_net_reclaim_title"="网络赎回";
"res_reclaim_takeback"="立即取回";

//2018-8-17
"eos_action_no_cpu"="账号的计算资源不足，请前往资源管理页面获取";
"eos_action_no_net"="账号的网络资源不足，请前往资源管理页面获取";
"res_title_reclaim_from"="取回账号";
"title_current_price"="价格";
"title_current_staked"="可赎回";

//2018-8-20
"transaction_tips_iq"="IQ智能合约会收取1/1000转账手续费";
"title_res_old"="旧版";

//2018-8-29
"qrcode_timeout"="二维码已过期";

//2018-8-30
"sdk_auth_title"="账号授权";
"sdk_auth_tips"="授权后该应用将获得以下权限：";
"sdk_auth_tips_account"="获取您的eos账号信息";
"sdk_auth_tips_no_pk"="注意：账号授权不会向DApp提供您的私钥";
"sdk_auth_account"="授权账号：";
"sdk_auth_change_account"="更换";
"sdk_auth_confirm"="确认授权";
"sdk_auth_nopass"="授权验证不通过";
"reclaim_account"="赎回账号";
"multi_select"="多选";
"reclaim_preview"="赎回预览";
"reclaim_acc_count"="赎回账号数";
"err_tips_reclaim_input_cpu"="输入的CPU数值有误!";"輸入的CPU數值有誤!";
"err_tips_reclaim_input_net"="输入的NET数值有误!";
"err_tips_cpu_net_nonnull"="请输入CPU/NET赎回数值!";
"err_tips_cpu_value_over"="输入的CPU数值不能大于已抵押CPU数值!";
"err_tips_net_value_over"="输入的NET数值不能大于已抵押NET数值!";
"reclaim_tips_max_count_6_per_chose"="单次最多选择6个";
"string_default_is_self"="(默认为自己)";

//2018-9-3
"dapp_sign"="签名";
"dapp_sign_info"="签名信息";

"tip_sdk_transfer_no_wallet"="没有当前底层的钱包!";
"tip_sdk_transfer_no_specified"="没有指定钱包!";
"sdk_transfer_from"="付款账号";
"sdk_transfer_to"="收款账号";
"tip_trans_reaffirm_cancel"="确定取消交易吗?";
"pay_for_trans"="订单支付";
"transfer_contract"="代币合约";

"tips_enter_the_url"="请输入URL";
"tip_clear_record"="确定要清空记录吗?";
"clear_records"="清空记录";

//2018-9-4
"dapp_action_warnning"="本次合约执行存在权限相关操作，请注意风险 >";
"tips_dev_mode_changed"="开发者模式已并入「DApp浏览器」";

//2018-9-6
"import_imported"="已导入";

//2018-9-11
"receiver_account_name"="收款账号";
"receiver_account_is_contract"="您输入的收款账号为合约账号，由于合约可以修改，请确保合约内容安全后再进行转账操。";
"collect"="收藏";
"cancel_collect"="取消收藏";

//2018-9-13
"sdk_push_transaction_title"="合约操作";
"sdk_push_transaction_required"="请求执行以下操作";
"sdk_push_transaction_detail"="查看操作详情";
"sdk_push_transaction_account"="执行账号名";
"sdk_push_transaction_operation"="操作列表";

//2018-9-14
"wallet_not_found"="未找到该钱包";
"set_time_transfer_tips"="定时交易可能由于网络原因存在一定偏差，请在确认使用该功能前进行足够的网络验证以确保交易时间的正确性。请注意，定时交易暂不支持取消。";
"set_time_transfer"="设置交易时间";
"title_my_dapp"="我的DApps";
"tips_input_dapp"="搜索DApp或输入链接进入玩耍";
"tips_search_null_dapp"="搜索DApp进入玩耍";
"my_stars"="我的收藏";
"unknown"="未知";
"set_time_transfer_time_tips"="选择不能小于当前时间";
"rcmd_dapps"="推荐DApps";
"go_to_dapp"="前往DApp: ";

"NSCameraUsageDescription"="TokenPocket需要使用您的相机进行二维码扫描，需要您的同意,才能访问相机";
"NSFaceIDUsageDescription"="TokenPocket需要使用FaceID进行身份识别，需要您的同意，才可以使用";
"NSPhotoLibraryAddUsageDescription"="TokenPocket在您需要进行图片识别时读取相册，需要您的同意,才能访问相册";
"NSPhotoLibraryUsageDescription"="TokenPocket在您需要进行图片识别时读取相册，需要您的同意,才能访问相册";

//2018-9-25
"edit"="编辑";
"dapp_whitelist"="白名单详情";
"dapp_sign_auth"="签名请求";
"dapp_whitelist_property"="属性";
"dapp_whitelist_operation"="操作";
"dapp_whitelist_add_ask"="开启白名单";
"dapp_whitelist_add_desc"="您可以将此操作列入白名单，下次就不必在此授权。勾选属性旁边的单选按钮意味着您允许此操作的该属性可以更改，仅当其他属性发生变化才不会被列入白名单。";
"dapp_whitelist_pwd_title"="输入密码以启用白名单";
"dapp_whitelist_pwd_desc"="白名单授权仅在DApp运行期间一定时间内有效，退出DApp，或者退出App都会导致授权失效，下次使用白名单需要输入密码以启用白名。";
"dapp_whitelist_title"="白名单列表";
"dapp_whitelist_cancel_contract"="取消合约";
"tips_observe_wallet_operation_disabled"="观察模式下的钱包不能进行此操作!";
"tips_public_key_import"="观察钱包不需要导入私钥，只导入账号名或公钥，进行日常查看账号、交易记录和接收通知";
"observer_wallet"="观察";
"observer_wallet_mode"="观察模式";
"tips_alert_observer_wallet_receipt"="当前钱包是观察模式，确定要向此账号转账吗?";
"title_receive_noti"="接收通知";

//2018-9-30
"dapp_select_account_empty"="您的钱包空空如也~";
"dapp_whitelist_pass_tips"="该操作已授权白名单，无需输入密码。";
"dapp_whitelist__timeout_pwd_desc"="本次白名单授权已经过期，请输入密码重启白名单。";

"hot_search" = "热门搜索";
"history_records"="历史记录";
"splash_title_skip"="跳过";

//2018-10-10
"dapp_whitelist_property_any"="任意";
"dapp_whitelist_cycle_app"="退出钱包App前授权有效";

"tips_pub_acc_import_error"="公钥或者账号名有误!";

//2018-10-17
"pay_touchid_tips"="使用指纹识别代替密码";
"pay_faceid_tips"="使用面部识别代替密码";
"pay_touchid"="指纹识别支付";
"pay_faceid"="面部识别支付";
"pay_valite_password_title"="验证密码";
"pay_valite_password_placeholder"="钱包密码";

"add_wallet"="添加钱包";
"tips_have_accounts_or_not"="你是否有账号？";
"tips_have_wallets_or_not"="你是否有钱包？";
"i_have_accounts"="我有账号";
"i_have_no_account"="我没有账号";
"i_have_wallets"="我有钱包";
"i_have_no_wallet"="我没有钱包";

"friend_create"="好友创建";
"contract_trans_create"="转账创建";
"free_account"="免费账号";
"invitation_code_create"="激活码创建";

"tips_row_import_wallet"="通过私钥、公钥或账号名导入钱包";
"tips_free_account_create"="使用TokenPocket官方提供的免费账号";
"tips_by_friend_create"="好友扫码支付创建账号";
"tips_by_invitation_code_create"="通过支付宝，微信购买激活码创建";
"tips_by_contract_trans_create"="往固定账号转账进行账号创建";

//2018-10-21
"invite_account_create_fail"="创建失败，请记住激活码并联系客服处理";
"invite_account_code_invalid"="激活码不存在或已使用";
"invite_account_check_tips"="帐户已创建并提交到主网,请在主网确认后（约3分钟）再进行交易，以确保创建成功。";

//2018-10-22
"account_backup_no_screen_tips1"="如果有人获得了你的私钥将直接获取你的资产！";
"account_backup_no_screen_tips2"="请抄写下私钥并存放在安全的地方";
"key_use_tips"="温馨提示：使用密钥前请备份私钥";
"invite_get_code"="点击获取激活码";

"tips_pls_add_wallet"="请先添加钱包";

"create_account"="创建账号";
"import_account"="导入账号";

//2018-10-24
"invitation_code"="激活码";

//2018-10-25
"wallet_current"="当前钱包";

//2018-10-28
"advanced_settings"="高级设置";
"advanced_settings_tips"="打开高级设置，下次进行该操作时，无需进行弹窗确认直接执行，开启后可前往更多中关闭";
"whitelist_open_tips"="DApp白名单开关已经移至设置，新增了体验更流畅的高级模式，是否前往开启白名单功能？";
"advanced_tips"="当前操作已经加入了白名单，并且开启了高级设置，授权后，操作会立即执行，是否继续？";
"whitelist_operation"="白名单功能";
"advanced_operation_doing"="操作执行中";

//2018-10-31
"dapp_whitelist_advanced_pass_tips"="该操作已开启高级模式，授权后无需弹窗确认";

//2018-11-1
"eos_transaction_unable_complete"="交易未完成，请检查资源是否充足";

//2018-11-7
"token_detail_title"="Token详情";
"token_detail_info"="项目详情";
"wallet_share_no_import"="没有需要导入的钱包";
"wallet_share_no_support"="数据太久未更新，不支持数据迁移";
"wallet_share"="钱包数据同步至App Store版本";

//2018-11-8
"wallet_share_title"="钱包数据迁移";
"wallet_share_about"="关于数据迁移";
"wallet_share_about_tips_1"="由于企业版本并不能保持长久的稳定服务，也存在部分功能缺失。因此为了让用户们能够使用稳定的服务，以及更全更强大的功能，同时减轻用户在切换APP时的工作负担，因此我们提供了企业版本数据迁移到AppStore版本功能。";
"wallet_share_about_tips_2"="迁移过程中，不存在数据泄漏问题，由于数据均加密，除了用户本人，均无人可破解 ，请放心使用。迁移面板弹出来后选择TokenPocket即可开始数据迁移。";
"wallet_share_attention"="迁移注意事项";
"wallet_share_about_attention_1"="该操作只迁移钱包数据，其他数据暂不支持迁移，且App Store版本必须大于等于1.0.7。";
"wallet_share_about_attention_2"="迁移如果出现失败或部分钱包迁移失败，请再次执行迁移直至成功，多次迁移不会导致数据错乱或丢失。";
"wallet_share_about_attention_3"="数据迁移不会影响App Store版本已经存在的钱包，如果App Store版本存在相同的钱包会自动忽略，但存在如果是观察钱包将会被覆盖。";
"web_refresh_desc"="点击重新加载";
"wallet_share_begin"="开始迁移";
"wallet_share_to_appstore"="下载App Store版本";
"rsrc_widget"="资源小插件";

"my_invitation_code"="我的激活码";

//2018-11-21
"res_rent_cpu"="租赁";
"recent_transfer_account"="最近转账";
"recent_transfer"="直接转账";
"recent_transfer_contact"="联系人转账";
"recent_transfer_scan"="扫码转账";


//2018-11-22
"asset_colletion_doing"="归置中";
"asset_colletion_success"="归置成功";
"asset_colletion_fail"="归置失败";
"asset_colletion_fail_net"="归置失败，请检查网络是否正常后重试";
"asset_colletion_cancel"="归置中断";
"asset_colletion_select_account"="请选择需要归置的账户";
"input"="输入";
"s_password"="的密码";
"check_net_point"="请检查节点网络是否正常";
"home_show"="首页展示";

"see_more"="查看更多";
"recent"="最近";

//2018-11-27
"asset_colletion"="资产归置";
"more_utilities"="更多工具";
"dapp_detail"="DApp详情";

//2018-11-28
"asset_colletion_confirm_tips_1"="确认将选中的钱包的";
"asset_colletion_confirm_tips_2"="归置到";

//2018-12-3
"no_net_tips"="检测到APP无网络权限，如果确认本机网络正常，可前往手机系统设置查看APP网络权限是否开启";

//2018-12-11
"screen_rotation"="屏幕旋转";
"transaction_cancel"="交易取消";
"sign_invalid"="无效的签名";
"scan_by_cold_wallet"="使用对应的冷钱包扫码签名";
"scan_by_observer_wallet"="使用对应的观察钱包扫码";
"wallet_has_net"="当前设备处于联网状态";
"cold_wallet_knowledge"="冷钱包小知识";
"cold_wallet_knowledge_1"="冷钱包也称离线钱包，用户将私钥存储在冷钱包，不会和互联网接触，有效保证资产安全";
"cold_wallet_knowledge_2"="冷钱包观察钱包运用二维码通信，私钥永不触网，能有效防止黑客窃取";
"cold_wallet"="冷钱包";

"push_noti"="推送通知";
"transfer_noti_normal"="普通钱包转账通知";
"transfer_noti_observe"="观察钱包转账通知";

//2018-12-12
"use_ob_scan"="使用热钱包在导入钱包界面扫码导入该冷钱包对应的观察钱包";
"recent_transfer_warn"="Memo填入的是上一次转账记录的Memo，请确认无误后再操作。";

"visitor_mode"="访客模式";
"visitor_mode_desc"="使用固定账号进行预览";
"eos_novice_teach"="EOS教程";
"visitor"="访客";
"tips_alert_visitor_receipt"="访客模式不能进行此操作";
"defautl_creater_public_key"="默认是创建者的公钥";

//2018-12-17
"scan_sign"="扫码签名";

"cold_wallet_cant_login"="冷钱包无法直接登录";

//2019-1-2
"plz_input_wallet"="请输入钱包名字";
"net_online"="当前处于了联网状态，确认要导入冷钱包吗？";
"all_assets"="全部资产";
"no_zero_assets"="非零资产";
"dex_list"="交易所列表";
"go_transaction"="去交易";

"ever_open"="永久开启";
"had_opened"="已开启";
"not_open"="未开启";
"had_closed"="已关闭";
"attention_things"="注意事项";

"temp_pay_by_touchID"="临时指纹识别支付";
"ever_pay_by_touchID"="永久指纹识别支付";
"temp_pay_by_faceID"="临时面容识别支付";
"ever_pay_by_faceID"="永久面容识别支付";

"open_pay_by_touchID"="开启永久指纹识别支付";
"close_pay_by_touchID"="关闭永久指纹识别支付";
"open_pay_by_faceID"="开启永久面容识别支付";
"close_pay_by_faceID"="关闭永久面容识别支付";

"temp_touchID"="临时指纹识别";
"ever_touchID"="永久指纹识别";
"temp_faceID"="临时面容识别";
"ever_faceID"="永久面容识别";

"open_by_touchID"="开启永久指纹识别";
"close_by_touchID"="关闭永久指纹识别";
"open_by_faceID"="开启永久面容识别";
"close_by_faceID"="关闭永久面容识别";

"ever_auth_description"="      永久免密使用了设备的生物识别技术进行确认使用者是否为设备拥有者，使用识别特性和安全加密算法进行加密，除了设备拥有者，其他人都无法获取密码。";
"ever_auth_sub_attention_title"="开启前，请您确认以下注意事项:";
"ever_auth_attention_points1"="请勿在本设备上添加他人的指纹识别/脸部识别。";
"ever_auth_attention_points2"="iOS设备的开机密码可以管理设备的指纹识别/脸部识别录入，请勿泄露本设备的开机密码。";
"ever_auth_attention_points3"="若本设备已经越狱，不建议开启此功能。";
"tip_returnd_because_ever_bio_auth"="已开启永久免密，无需再开启临时免密";

"app_lock"="应用锁";

"title_faceid"="面容识别";
"title_touchid"="指纹识别";

//2019-1-5
"token_suppot"="当前Token只支持 ";

//2019-1-14
"bos_map_time_desc"="\tBOS账号映射时间为2019年1月1日，09:50 UTC+0, 区块高度为35072000，因此非此前创建的账号将无法在BOS上找到对应的账号";
"bos_map_rule"="映射规则：";
"bos_map_rule_1"="对于非多签账号，EOS主网账号每 20.0000 EOS可以获得 1.0000 BOS，每个BOS账号最少可以获得0.5000 BOS";
"bos_map_rule_2"="对于多签账号，账户余额的映射规则和非多签账号一致，并且对账号的权限进行了同步映射";
"bos_map_rule_3"="BOS账号根据EOS主网账号随机生成";
"bos_map_rule_4"="BOS账号的资源分配，RAM：0.3000 BOS，CPU：0.1000 BOS，NET：0.1000 BOS";
"account_sync"="BOS账号一键同步";
"begin_sync"="开始同步";
"one_sync"="一键同步";
"one_sync_desc"="将映射的EOS账户同步至BOS账号";
"no_sync_account"="没有可以同步的账户";
"sync_success"="同步成功";

"chat"="聊天";
"marketplace"="市场";

//2019-1-29
"already_save_album"="已保存到本地相册";
"plz_auth_im"="请先在钱包的聊天页面进行授权登录";
"fetch_group_info_error"="拉取群信息失败";
"upload_avatar"="上传头像";
"choose_from_album"="从相册中选择";
"take_picture"="拍照";
"modify_nickname"="修改昵称";
"nickname_no_empty"="昵称不能为空";
"nickname_too_long"="昵称过长";
"follow"="关注";
"unfollow"="取消关注";
"req_fail"="请求失败";
"sex_or_violence"="色情暴力";
"illegal"="违反法律";
"other"="其他";
"dapps_playing"="在玩的DApp";
"im_personal_acc"="账号：";
"report_success"="举报成功";
"report_fail"="举报失败";
"already_get"="已领取";
"already_expired"="已过期";
"your_get_your_redpacket"="你领取了自己发的红包";
"get_your_redpacket"="领取了你的红包";
"redpacket_is_full"="，红包已被领完";
"your_get"="你领取了";
"its_redpacket"="的红包";
"redpacket_get"="领取了";
"tp_redpacket"="TP红包";
"redpacket_is_full_cheer"="红包已被领完，再接再厉";
"current_account_no_get"="当前账号不能领取";
"redpacket"="红包";
"im_tools_camera"="拍摄";
"im_tools_photos"="相册";
"redpacket_already_expired"="红包已过期";
"knock_redpacket_fail"="抢红包失败";
"read_detail"="查看详情";
"send_readpacket"="发红包";
"best_wishes"="恭喜发财，大吉大利!";
"member_all"="共";
"group_member"="个成员";
"change_to_fight_redpacket"="切换到拼手气红包";
"change_to_normal_redpacket"="切换到普通红包";
"current_is_fight_redpacket"="当前为拼手气红包，";
"current_is_normal_redpacket"="当前为普通红包，";
"total_amount"="总额";
"one_amount"="单个数额";
"plz_input_red_number"="请填写红包个数";
"sunday"="星期日";
"saturday"="星期六";
"friday"="星期五";
"thursday"="星期四";
"wednesday"="星期三";
"tuesday"="星期二";
"monday"="星期一";
"yesterday"="昨天";
"early_morning"="凌晨";
"morning"="上午";
"afternoon"="下午";
"evening"="晚上";
"member"="人";
"search_my_follow"="搜索我的关注";
"search_my_group"="搜索我的群组";
"search_result"="搜索结果";
"my_follow"="我的关注";
"unfollow_fail"="取消关注失败";
"address_book"="通讯录";
"my_group"="我的群组";
"exit_group_simple"="退群";
"exit_group_faIl"="退出失败";
"create_group"="创建群聊";
"group_name_max_char"="群名最多20个字符";
"group_name_min_char"="群名不能为空";
"group_intro_max_char"="群简介最多250个字符";
"create_fail"="创建失败";
"plz_input_group_name"="请输入群名";
"group_info"="群聊信息";
"enter_chat"="进入聊天";
"apply_enter"="申请加入";
"exit_group"="退出群聊";
"group_owner_no_exit"="群主不能退出群聊";
"apply_send"="申请已发送";
"apply_fail"="申请失败";
"group_name"="群名";
"group_code"="群二维码";
"group_intro"="群简介";
"group_members"="群成员";
"message_not_notify"="消息免打扰";
"report"="举报";
"kick"="踢出";
"kick_fial"="踢出失败";
"add_member"="添加群成员";
"invite_success"="邀请成功";
"invite_fail"="邀请失败";
"detail"="详情";
"personal_info"="个人信息";
"message_top"="置顶";
"message_cancel_top"="取消置顶";
"logging"="登录中";
"audio"="语音";
"photo"="图片";
"video"="视频";
"location"="位置";
"file"="文件";
"unknow_message"="未知消息";
"group_update_message"="群有新动态";
"account_kick_tips"="您的聊天账号在其他设备登录，请确认账号安全";
"account_blocked"="账户被封禁";
"im_login_auth_fail"="验证失败，请重试";
"current_not_support_im"="当前钱包不能使用聊天功能";
"blockchain_error_tips"="节点链接错误，请检查链接是否有误";
"at_in_group"="在群里@了你";
"not_login_im"="未登陆聊天";
"save_album"="保存到本地相册";
"distinguish_album"="识别图中二维码";
"group"="群";
"your"="你";
"change_room_queue"="改变了聊天室队列";
"room_unmuted"="解除全体禁言";
"room_muted"="全体禁言，管理员可发言";
"change_self_info"="更新了自己的个人信息";
"unmute_personal"="被管理员解除临时禁言";
"mute_personal"="被管理员禁言";
"your_mote"="你已被临时禁言";
"unknow_system"="未知系统消息";
"mute"="禁言";
"unmute"="解除禁言";
"be"="被";
"accept"="接受";
"invite_group"="的邀请进群";
"cancel_manager"="被撤销了群管理员身份";
"add_manager"="被添加为群管理员";
"change_group_owner_to"="转移了群主身份给";
"invite"="邀请";
"dismiss"="解散了";
"removed"="移出了";
"will"="将";
"and_so_on"="等";
"entered"="进入了";
"modify"="更新了";
"infomation"="信息";
"passed"="通过了";
"apply"="申请";
"leaved"="离开了";
"intro"="介绍";
"auth_type"="验证方式";
"group_notice"="公告";
"avatar"="头像";
"change_group_invite_type"="更新了邀请他人权限";
"change_group_beinvite_type"="更新了被邀请人身份验证权限";
"change_group_info_update_auth"="更新了群资料修改权限";
"set_group_all_mute"="设置了群全体禁言";
"set_group_all_unmute"="取消了全体禁言";
"send"="发送";
"plz_import_wallet"="请先导入钱包";
"im_profile_account"="账号";
"im_profile_nickname"="昵称";
"im_group_recommend"="推荐群组";
"im_plz_input"="请输入消息";
"chat_log_tip"="聊天与您账号紧密关联，需要您进行签名验证";
"chat_log_btn"="开始验证";

"mins"="分钟";
"next_round"="下一轮";
"chat_create_about"="群简介";
"chat_create_name"="群名字";
"chat_create_about_pla"="对群进行简单介绍（最多250个字符）";
"chat_create_name_pla"="设置群名（最多20个字符）";

//2019-2-20
"authentication_message"="验证消息";
"alreay_accept"="已同意";
"alreay_refuse"="已拒绝";
"alreay_invalid"="已过期";
"apply_team"="申请加入群";
"refuse_apply"="拒绝你加入";
"remove_team"="移出群聊";
"alreay_remove_team"="已移出聊天";
"accept"="同意";
"refuse"="拒绝";
"net_error_tips"="网络异常，请重试";
"team_not_exist"="群不存在";
"clear_all"="清空";
"share_a_dapp"="分享了一个DApp";
"select_a_chat"="选择一个聊天";
"recent_chat"="最近聊天";
"alreay_send"="已发送";
"team_owner"="群主";
"admin"="管理员";
"send_to"="发送到";
"whether_transfer_owner_to"="是否将群主转让给";
"admin_has_permission"="群管理员有以下权限：";
"admin_permission_1"="1. 打开入群验证";
"admin_permission_2"="2. 同意或拒绝新成员入群";
"admin_permission_3"="3. 主动添加或移除成员";
"team_members_limit"="群人数已达上限";
"join_team_fiter"="加群验证";
"transfer_team_owner"="转让群主";
"admin_manager"="设置管理员";
"owner_transfer_suc"="转让成功";
"owner_transfer_fail"="转让失败";
"team_admin_limit_tips"="最多设置4个管理员";
"add_suc"="添加成功";
"add_fail"="添加失败";
"add_admin"="添加管理员";
"admin_list_and_tips"="管理员列表（左滑可移除）";
"new_short_account_suf_must_tips"="新建短账号后缀必须是";

"at_all"="所有人";
"at_you"="有人@我";
"forward"="转发";
"recall"="撤回";
"did_send"="已发送";
"did_forward"="已转发";
"multi_chain"="多底层";
"recalled_a_msg"="撤回了一条消息";
"im_you"="你";
"quote"="引用";
"tip_recall_expired"="发送时间超过2分钟的消息，不能被撤回";
"has_recalled"="撤回了";
"message"="消息";
"im_your"="你的";
"im_de"="的";

//2019-2-20
"use_tp_scan_enter_team"="使用TP钱包扫码入群";
"share_qrcode"="分享二维码";
"confirm_enter"="确认加入";
"whether_confirm_enter_team"="是否确认加入群聊？";
"plz_enter_amount"="请输入金额";

"draft"="草稿";

//2019-3-7
"total_stake"="总抵押";
"amount_up_1"="数量不能小于1";
"refund_list"="赎回列表";
"refund_amount"="赎回数量";
"refund_time"="赎回时间";
"account_in_5_11"="账户名必须5到11位";
"transaction_state_unknow_see_browser"="状态未知,可前往浏览器查询确认交易是否成功";
"gas_stake"="iGAS抵押";

"create_with_mobile_number"="手机号/邮箱创建";
"create_with_mobile_desc"="通过手机号/邮箱注册账号";
"import_with_mobile_number"="手机号/邮箱登录";
"import_with_mobile_desc"="通过手机号/邮箱验证的方式，进行账号登录";
"register"="注册";
"login"="登录";
"sign_in"="登录";

"import_with_pri_key"="私钥导入";
"import_with_pri_key_desc"="通过输入明文私钥或扫描私钥二维码进行导入";
"import_with_pub_key"="观察钱包";
"import_with_pub_key_desc"="无需导入私钥，输入账号或者对应公钥即可导入";
"import_with_cold"="冷钱包";
"import_with_cold_desc"="离线导入并保持与网络隔绝，确保私钥永不触网";
"import_with_key_store"="Keystore";
"import_with_key_store_desc"="通过导入Keystore添加钱包";
"import_with_mnemonic"="助记词";
"import_with_mnemonic_desc"="通过导入助记词添加钱包";
"stake_number"="抵押数量";
"account_chars_5_11_tip"="[a-z0-9_]组成的长度为5-11位的字符串";

"url_link"="链接";
"about_mobile_wallet"="关于手机号/邮箱钱包";
"use_email"="使用电子邮箱";
"use_phone"="使用手机号码";
"plz_enter_phone_num"="请输入手机号码";
"plz_enter_email_addr"="请输入邮箱地址";
"plz_enter_auth_code"="请输入验证码";
"get_auth_code"="获取验证码";
"retry"="重试";
"phone_num_err"="手机号码有误";
"email_num_err"="邮箱地址有误";
"tip_auth_code_be_used_plz_retry"="验证码已过期/不正确，请重新获取";
"tips_never_created_acc"="未创建过账号";
"reg_will_agree"="注册即同意";
"and"="和";
"set_pwsd"="设置密码";
"your_account_name"="您的账号名";
"your_email"="您的电子邮箱";
"your_phone"="您的手机号码";
"plz_enter_actv_code"="请输入激活码";
"complete_creation"="完成创建";
"way_of_creation"="创建方式";
"way_of_payment"="支付方式";
"contact_us_if_any_question"="遇到问题，请联系我们";
"tp_recovery"="TP恢复权";
"eos_faq_tp_recovery_title"="什么是TP恢复权限？";
"eos_faq_tp_recovery_expl"="手机号注册用户会拥有TP恢复权限，TP恢复权限属于owner权限，可在用户忘记或丢失私钥的情况下，通过手机认证的方式进行私钥恢复。 如果用户将该权限删除或使得该权限的权重阈值低于owner权限阈值，TP将无法帮助用户进行私钥恢复。 使用手机号登录或恢复账号，都会进行旧公钥替换，新公钥均由用户本地上传。";
"tips_tp_help_recover_account"="登录操作会替换旧公钥，此前的私钥都将被重置，确定登录吗?";
"alert_delete_tp_recovery_right"="删除、变更TP恢复权或降低该权限的权重低于owner权限阈值，TP将无法帮您进行私钥恢复，请确认已备份好私钥。确定继续操作吗？";
"tip_eos_account_name_range_normal"="名称由1-5和a-z字符组成，长度为12位";
"tip_eos_account_name_range_short"="名称由1-5 a-z和.字符组成，长度为3-12位";

"tip_already_exists"="已存在";
"tip_available"="可用";
"tip_not_available"="不可用";
"tip_acc_length_should_be_%@_chars"="账号为%@个字符";
"tip_acc_need_to_enter_%@_chars"="需输入%@个字符";

//2019-3-22
"tap_forward_setting"="点击前往设置";
"set_asset_show"="设置资产展示";
"show_asset_set"="展示资产设置";
"member_list"="成员列表";
"voted_bp"="已投节点：";
"get_bonus"="领取分红";
"block_node"="出块节点";
"candidate_node"="合伙人节点";
"frozen"="冻结";
"pull_fail"="拉取失败";

"tp_transfer"="TP转账";
"transfer_to_%@"="转账给%@";
"title_tansfer"="转账";
"receipt_tansfer"="收到转账";
"apn_tip_im_receipt_transfer_%@"="[转账] 收到转账 %@";
"tip_actv_code_can't_create_%@"="该激活码无法创建%@";
"tip_actv_code_been_used"="该激活码已使用过";
"tip_actv_code_cant_rgnz"="该激活码无法识别";
"tip_actv_code_auth_fail"="激活码验证失败";
"tip_actv_code_not_payed"="激活码未被支付";
"tip_actv_code_cpu_ram_fail"="CPU/RAM不足";
"tip_actv_code_update_code_fail"="更新code状态失败";
"tip_search_token_empty_to_submit"="没有找到相应的代币？点此提交收录申请。";
"title_im_noti"="聊天消息通知";
"i_know_temrs_below"="我悉知以下事项:";
"password_can't_less_than_8_chars"="密码不能少于8位";
"set_account_name"="设置账号名";
"set_wallet_name"="设置钱包名";

"add_accounts"="添加账号";
"bp_rank"="节点排名";
"see_sign_info"="查看签名内容";
"sdk_sign_tips_no_pk"="注意：信息签名不会向DApp提供您的私钥";
"tip_tp_code_copied_paste_it"="TP口令已复制，快去分享吧~";
"common_code_copy_text_%@_then_open_in_tp"="复制整段文本%@后到TokenPocket打开";
"tp_cmd_key"="TP口令";
"param_error"="参数错误";
"invite_friend_reg"="邀请好友注册";
"check_u_copied_a_tp_code"="检查到您复制了TP口令";
"open_immediately"="立即打开";
"unknown_type_pls_update_version"="未知类型，请更新版本";
"auto_filter_chars_%@"="自动过滤字符: %@";
"random_account"="随机账号";

//4-16
"amount_than_100k"="数量必须大于0.01KB";
"add_repeat"="不能重复添加";
"iram_not_enough"="iRAM资源不足，请前往资源管理页面获取";
"igas_not_enough"="iGas资源不足，请前往资源管理页面获取";
"sell_iram_not_enough"="可卖出iRAM数量不足";
"unstake_amount_not_enough"="可赎回数量不足";
"select_bps:"="已选节点：";
"voted_proxy"="已投代理";
"none"="无";
"pk_exprot_warnning"="安全警告：私钥未经加密，导出存在风险。";
"powered_by_eosAuth"="数据来源: EOSAuthority";

"current_fund"="当前底层";
"tap_to_switch"="点击切换";

"tip_multy_ways_to_create"="使用多种方式进行创建";
"selected"="已选";
"z_news"="资讯";

"iost_refund_list"="赎回列表";
"iost_vote_title_producer"="节点投票";
"iost_bp_rank"="节点排名";


"batch_creation"="批量创建";
"batch_random"="批量随机";
"new_account_puk"="新账号公钥";
"resource_dispatch"="资源配置";
"indicates_account_available"="表示账号可用";
"indicates_account_unavailable"="表示账号不可用";
"estimate_cost"="预计花费：";
"begin_create"="开始创建";
"batch_tips_1_%@"="新注册账号的公钥与%@一致，可以 点击此处 修改";
"batch_tips_1_1"="点击此处 返回默认公钥";
"batch_tips_2"="新注册账号资源分配情况为 RAM 4 KB，CPU 0.05 EOS，NET 0.01 EOS，可以 点击此处 进行修改";
"batch_tips_2_1"="点击此处 返回默认资源配置";
"tap_this"="点击此处";
"custom_account"="自定义账号";
"create_account_num"="创建账号数量";
"import_after_creation"="创建完成后是否自动导入?";
"import"="导入";
"not_import"="不导入";
"create_result"="创建结果";
"create_success"="创建成功";
"create_fail"="创建失败";
"create_fail"="创建失败";
"unfold"="展开全部";
"batch_password_tips"="*创建完后，账号会使用改密码进行导入";
"account_input_or_ramdon"="输入账号或点击左边随机生成";
"add_one"="添加一个";
"account_grade_alert_content"="由于您当前的资产额度超过 10 EOS，TP钱包建议您从伙伴账号升级到个人账号。";
"go_greade"="前往升级";
"next_time"="下次再说";
"account_grade"="账号升级";
"account_grade_tips_content"="您已备份成功，我们将在此页面帮助您将伙伴账号升级为个人账号。";
"account_grade_read"="升级前，请您仔细阅读一下注意事项：";
"account_grade_read_1"="本次升级将移除TP的恢复权限，移除后，您无法再次使用手机号进行该账号登录";
"account_grade_read_2"="移除TP恢复权限后，您仅可以使用您刚刚备份的私钥进行账号导入，请您务必保护好私钥";
"account_grade_read_3"="如果您本次没有进行账号升级，则下次使用手机号登录后，您刚备份的私钥将失效。";
"account_grade_already_read"="我已仔细阅读以上内容，并了解账号升级相关事宜";
"grade_first"="立即升级";
"grade_success"="升级成功";
"grade_fail"="升级失败";
"not_confirm_exit_app"="退出APP前该DAPP无需再次确认";
"third_parties"="第三方创建";
"third_parties_desc"="最受欢迎的第三方账号创建";

"create_jion_team_code"="生成加群口令";
"save_to_local"="保存本地";
"share_group"="群分享";

"join_immediately"="立即加入";
"select_region"="选择地区";
